{
  "confirm": {
    "delete": "쮼st치s seguro de que quieres eliminar \"{{name}}\"?",
    "deletePermanently": "쮼st치s seguro de que quieres eliminar permanentemente \"{{name}}\"?",
    "deleteConfirmMultipleSnippets": "쮼st치s seguro de que quieres eliminar permanentemente {{count}} snippets seleccionados?",
    "emptyTrash": "쮼st치s seguro de que quieres eliminar permanentemente todos los snippets de la Papelera?",
    "clearDb": "쮼st치s seguro de que quieres limpiar la base de datos?",
    "migrateDb": [
      "쮼st치s seguro de que quieres migrar?",
      "Durante la migraci칩n, la biblioteca actual ser치 sobrescrita."
    ]
  },
  "success": {
    "migrate": "Base de datos migrada exitosamente."
  },
  "warning": {
    "noUndo": "No podr치s deshacer esta acci칩n.",
    "allSnippetsMoveToTrash": "Todos los snippets en esta carpeta se mover치n a la papelera.",
    "deleteTag": "Esto tambi칠n causar치 que se elimine la etiqueta de todos los snippets.",
    "createDb": "Por favor selecciona otra carpeta",
    "clearDb": "Esto eliminar치 permanentemente todos los Snippets, Carpetas y Etiquetas de la base de datos.",
    "htmlCssPreview": "Agregue un fragmento HTML para ver el resultado. Agregue CSS para el estilo y JavaScript para la interactividad.",
    "codeBlockRenderer": [
      "Al usar Codemirror, el lenguaje a establecer para el bloque de c칩digo debe corresponder a uno de los valores de los",
      "languages"
    ]
  },
  "error": {},
  "description": {
    "storage": "Para usar servicios de sincronizaci칩n como iCloud Drive, Google Drive o Dropbox, simplemente mueve el almacenamiento a las carpetas sincronizadas correspondientes",
    "migrate": {
      "fromV3": "Para migrar desde massCode v3 selecciona la carpeta que contiene el archivo JSON.",
      "fromSnippetsLab": "Para migrar desde SnippetsLab selecciona el archivo JSON.",
      "snippetsLabLimitations": [
        "Algunas limitaciones. Durante la migraci칩n desde SnippetsLab:",
        "Todas las carpetas ser치n de primer nivel ya que el archivo JSON (inferior a v2.1) no representa carpetas anidadas.",
        "Los snippets con lenguajes no soportados se establecer치n como Plain Text por defecto."
      ]
    }
  },
  "special": {
    "supportMessage": "Hola, soy Anton 游녦<br><br>\nGracias por usar massCode. Si encuentras 칰til esta aplicaci칩n, por favor {{-tagStart}}dona{{-tagEnd}}. Me inspirar치 a continuar el desarrollo del proyecto.",
    "unsponsored": "Sin patrocinio"
  },
  "update": {
    "available": "La versi칩n {{newVersion}} est치 disponible para descargar.\nTu versi칩n es {{oldVersion}}.",
    "noAvailable": "Actualmente no hay actualizaciones disponibles."
  }
}
