{
  "confirm": {
    "delete": "Είστε βέβαιοι ότι θέλετε να διαγράψετε το \"{{name}}\"?",
    "deletePermanently": "Είστε βέβαιοι ότι θέλετε να διαγράψετε οριστικά το \"{{name}}\"?",
    "deleteConfirmMultipleSnippets": "Είστε βέβαιοι ότι θέλετε να διαγράψετε οριστικά τα {{count}} επιλεγμένα snippets;",
    "emptyTrash": "Είστε βέβαιοι ότι θέλετε να διαγράψετε οριστικά όλα τα snippets στον Κάδο Απορριμμάτων;",
    "clearDb": "Είστε βέβαιοι ότι θέλετε να καθαρίσετε τη database;",
    "migrateDb": [
      "Είστε βέβαιοι ότι θέλετε να κάνετε migrate;",
      "Κατά τη διάρκεια του migrate, η τρέχουσα βιβλιοθήκη θα αντικατασταθεί."
    ]
  },
  "success": {
    "migrate": "Η DB μετέφερε επιτυχώς τα δεδομένα."
  },
  "warning": {
    "noUndo": "Δεν μπορείτε να αναιρέσετε αυτήν την ενέργεια.",
    "allSnippetsMoveToTrash": "Όλα τα snippets σε αυτόν τον φάκελο θα μεταφερθούν στον κάδο απορριμμάτων.",
    "deleteTag": "Αυτό θα προκαλέσει επίσης την αφαίρεση αυτού του tag από όλα τα snippets.",
    "createDb": "Παρακαλώ επιλέξτε άλλο φάκελο",
    "clearDb": "Αυτό θα διαγράψει οριστικά όλα τα Snippets, Folders και Tags από τη database.",
    "htmlCssPreview": "Προσθέστε ένα τμήμα HTML για να δείτε το αποτέλεσμα. Προσθέστε CSS για στυλ και JavaScript για διαδραστικότητα.",
    "codeBlockRenderer": [
      "Όταν χρησιμοποιείτε το Codemirror, η γλώσσα που θα οριστεί για το code block πρέπει να αντιστοιχεί σε μία από τις τιμές των",
      "languages"
    ]
  },
  "error": {},
  "description": {
    "storage": "Για να χρησιμοποιήσετε υπηρεσίες συγχρονισμού όπως iCloud Drive, Google Drive ή Dropbox, απλά μετακινήστε το storage στους αντίστοιχους συγχρονισμένους φακέλους",
    "migrate": {
      "fromV3": "Για να κάνετε migrate από το massCode v3 επιλέξτε τον φάκελο που περιέχει το JSON αρχείο.",
      "fromSnippetsLab": "Για να κάνετε migrate από το SnippetsLab επιλέξτε το JSON αρχείο.",
      "snippetsLabLimitations": [
        "Μερικοί Περιορισμοί. Κατά τη διάρκεια του migration από το SnippetsLab:",
        "Όλοι οι φάκελοι θα είναι πρώτου επιπέδου καθώς το JSON αρχείο (κάτω από v2.1) δεν υποστηρίζει ένθετους φακέλους.",
        "Τα snippets με μη υποστηριζόμενες γλώσσες θα οριστούν ως Plain Text."
      ]
    }
  },
  "special": {
    "supportMessage": "Γεια σας, ο Anton εδώ 👋<br><br>\nΕυχαριστώ που χρησιμοποιείτε το massCode. Αν βρίσκετε χρήσιμη την εφαρμογή, παρακαλώ {{-tagStart}}κάντε μια δωρεά{{-tagEnd}}. Θα με εμπνεύσει να συνεχίσω την ανάπτυξη του project.",
    "unsponsored": "Χωρίς χορηγία"
  },
  "update": {
    "available": "Η έκδοση {{newVersion}} είναι διαθέσιμη για λήψη.\nΗ έκδοσή σας είναι {{oldVersion}}.",
    "noAvailable": "Δεν υπάρχουν διαθέσιμες ενημερώσεις αυτή τη στιγμή."
  }
}
